Revit 2027 API
BuiltInFailures.RoomFailures.NoReferenceRecenteredWarning Property
 0 room reference has been re-centered.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoReferenceRecenteredWarning { get; }
Public Shared ReadOnly Property NoReferenceRecenteredWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoReferenceRecenteredWarning {
	FailureDefinitionId^ get ();
}
static member NoReferenceRecenteredWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace